In [1]:
# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
import pandas as pd
import sqlite3

# IMDB

In [3]:
conn = sqlite3.connect('./zippedData/im.db')

In [4]:
pd.read_sql("""
SELECT *
FROM sqlite_master
;""", conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [5]:
actors = pd.read_sql(
"""
SELECT
    category,
    pr.movie_id,
    pr.person_id,
    primary_name,
    primary_title 
FROM 
    principals AS pr
JOIN
    movie_basics AS mb using(movie_id)
JOIN
    persons AS pe using(person_id)
WHERE
    category = 'actor'
    or
    category = 'actress'
    or
    category = 'self'
""",conn)
actors

,category,movie_id,person_id,primary_name,primary_title
0,actor,tt0111414,nm0246005,Tommy Dysart,A Thin Life
1,actress,tt0323808,nm3579312,Brittania Nicol,The Wicker Tree
2,actor,tt0323808,nm2694680,Henry Garrett,The Wicker Tree
3,actor,tt0323808,nm0574615,Graham McTavish,The Wicker Tree
4,actress,tt0323808,nm0502652,Jacqueline Leonard,The Wicker Tree
...,...,...,...,...,...
468072,actor,tt9689618,nm10439726,Christian Lacroix,Moonface. A woman in the war.
468073,actor,tt9689618,nm10439727,Christine Spengler,Moonface. A woman in the war.
468074,actor,tt9689618,nm10439724,Phillippe Warner,Moonface. A woman in the war.
468075,actor,tt9692684,nm0186469,Kenneth Cranham,Disnatured
468076,self,tt9692684,nm4929530,Pearl Mackie,Disnatured